export const text = `
Мы встретились с тобой
Не зная кто мы есть
Ты посмотрела на меня
Как на дворового пацана

И с первого взгляда мы подумали одно
Что этот человек уж точно не мое необходимое звено
И разошлись мы в этой день, не думая ни о чем 
Но уже на небе
Зажегся новый огонек

Но судьба-злодейка сказала нам другое:
Ребятки не торопитесь, и на квесте окажитесь
И на первой же прогулки
Нам пришлось с тобой сплотиться
Чтобы в лабиринте нам не заблудиться
И не осознав, как ловко мы его прошли
В кафе с тобою перешли
Но снова квест пришлось решить 
Чтобы чудный приз заполучить

И разъехавшись с тобою по домам
Наш огонек стал ярче греть
И вскоре квест наш повторился
Пирог в квартире очутился

И быстро головы вскружились
Не замечая, как пролетают чудные деньки
С тобой по лесу хладному идём
И тут в груди волнение краткое 
Как будто мысли общие связались
И робко слышишь ты: 
Будь со мной
И друг другу посмотрев в глаза
Ты решила для себя и ответила мне «да»

Пошёл отсчет  совместных наших дней
И день девятый ежемесячно
Мы вспоминаем неспроста 
Все больше наш горит огонь
Даря все больше сладкого тепла

Но и предугадать такое сложно
Что жизнь захочет в самом старте
Придумать испытание непростое 
Но для чего? - ответа нет

Но ты без узарения 
Подбадрила сразу же меня
И больную мою коленку
Мы вместе вылечить смогли

Ты показала мне такое
Что и представить я не мог
Заботу, помощь и поддержку
Хотя с тобой совсем недавно
Могли не знать друг друга даже

И тут жизнь вдоволь насытившись
Своими ситуациями не простыми
Решила отдохнуть
Но нас уже не остановить 
Держа совместно наш огонь
Решили мы идти совместно дальше
И праздник сказочный
День первый года
Мы встретили совместно
И в кругу семьи

Но вот все ближе мы с тобой
И все быстрей текут деньки
Как будто вечность мы знакомы 
Но лишь сейчас подходим к цифре
В 6 месяцев с тобой
Но перед этим приключением 
Другой есть повод для веселья
Ведь с цифрой 6 еще есть праздник

В такой прекрасный майский день
У превосходной женщины моей 
Настал день наслаждения
Ведь День рождения у тебя!

Тебя поздравить я спешу
И пожелание есть одно
Все будет, но не сразу 
И сдаваться, ты, не вздумай!
`
export const textPoem = text.split('\n')

export const textPoemByBlock = text.split(/^\n/m)
